src_Extension/Reports/ПрименяемостьМатериалаВИзделиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПрименяемостьМатериалаВИзделиях</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоИзделия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Применяемость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src_Extension/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Enums/ВариантыПодбораСпецификацииВДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыПодбораСпецификацииВДокументы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Reports/ПрименяемостьМатериалаВИзделиях/Ext/ObjectModule.bsl
&НаСервере
//Перем Материал;
//Перем ДатаАктуальности;
//Перем ТолькоИзделия;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
		КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Получаем параметр Материал
	НайденныйПараметр = Неопределено;
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Материал");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр = Неопределено тогда
		ВызватьИсключение "Не задан материал!";
	КонецЕсли;
	Материал = НайденныйПараметр.Значение;
	
	// Получаем параметр Дата
	НайденныйПараметр = Неопределено;
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НайденныйПараметр.Значение) тогда
		ДатаАктуальности = ТекущаяДатаСеанса();
	Иначе
		ДатаАктуальности = НайденныйПараметр.Значение;
	КонецЕсли;
	
	// Получаем параметр ТолькоИзделия
	НайденныйПараметр = Неопределено;
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ТолькоИзделия");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр = Неопределено тогда
		ТолькоИзделия = Истина;
	Иначе
		ТолькоИзделия = НайденныйПараметр.Значение;
	КонецЕсли;
	
	РассчитатьПрименяемость();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Применяемость", Применяемость);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПрименяемость()
	
	Применяемость.Очистить();
	
	// Определяем группу видов номенклатуры для фильтрации готовой продукции
	ГруппаВидов = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("1. Готовая продукция");
	Если ГруппаВидов = Неопределено ИЛИ ГруппаВидов.Пустая() тогда
		Сообщить("Не найдена группа видов номенклатуры ""1. Готовая продукция"", делаем поиск по всем деталям!");		
		ТолькоИзделия = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Шаг 1: Находим все спецификации, где материал используется напрямую
	// и считаем удельный расход на 1 изделие по этой спецификации
	// Берём только приоритетные спецификации (с максимальным кодом для каждого изделия)
	Запрос.Текст = 
		"// Находим все спецификации с материалом
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МатериалыИУслуги.Ссылка КАК Спецификация,
		|	МатериалыИУслуги.Ссылка.Код КАК КодСпецификации,
		|	МатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
		|	ВЫБОР
		|		КОГДА МатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок > 0
		|			ТОГДА МатериалыИУслуги.КоличествоУпаковок / МатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок
		|		ИНАЧЕ МатериалыИУслуги.КоличествоУпаковок
		|	КОНЕЦ КАК УдельныйРасход
		|ПОМЕСТИТЬ ВТВсеСМатериалом
		|ИЗ
		|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК МатериалыИУслуги
		|ГДЕ
		|	МатериалыИУслуги.Номенклатура = &Материал
		|	И НЕ МатериалыИУслуги.Ссылка.ПометкаУдаления
		|	И МатериалыИУслуги.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
		|	И МатериалыИУслуги.Ссылка.ВариантПодбораВДокументы = ЗНАЧЕНИЕ(Перечисление.ВариантыПодбораСпецификацииВДокументы.Автоматически)
		|	И (МатериалыИУслуги.Ссылка.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ МатериалыИУслуги.Ссылка.НачалоДействия <= &ДатаАктуальности)
		|	И (МатериалыИУслуги.Ссылка.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ МатериалыИУслуги.Ссылка.КонецДействия > &ДатаАктуальности)
		|;
		|// Находим приоритетную спецификацию для каждого изделия (с максимальным кодом)
		|ВЫБРАТЬ
		|	ВТВсеСМатериалом.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
		|	МАКСИМУМ(ВТВсеСМатериалом.КодСпецификации) КАК МаксКод
		|ПОМЕСТИТЬ ВТПриоритетныеКодыНачальные
		|ИЗ
		|	ВТВсеСМатериалом КАК ВТВсеСМатериалом
		|СГРУППИРОВАТЬ ПО
		|	ВТВсеСМатериалом.ОсновноеИзделиеНоменклатура
		|;
		|// Оставляем только приоритетные спецификации
		|ВЫБРАТЬ
		|	ВМ.Спецификация КАК Спецификация,
		|	ВМ.Спецификация КАК ГоловнаяСпецификация,
		|	ВМ.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
		|	ВМ.УдельныйРасход КАК УдельныйРасход
		|ПОМЕСТИТЬ ВТНачальные
		|ИЗ
		|	ВТВсеСМатериалом КАК ВМ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритетныеКодыНачальные КАК ПК
		|		ПО ВМ.ОсновноеИзделиеНоменклатура = ПК.ОсновноеИзделиеНоменклатура
		|			И ВМ.КодСпецификации = ПК.МаксКод
		|;
		|УНИЧТОЖИТЬ ВТВсеСМатериалом
		|;
		|УНИЧТОЖИТЬ ВТПриоритетныеКодыНачальные";
	
	Запрос.УстановитьПараметр("Материал", Материал);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.ВыполнитьПакет();
	
	// Копируем начальные данные в рабочую таблицу для итераций
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТНачальные.Спецификация КАК Спецификация,
		|	ВТНачальные.ГоловнаяСпецификация КАК ГоловнаяСпецификация,
		|	ВТНачальные.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
		|	СУММА(ВТНачальные.УдельныйРасход) КАК УдельныйРасход
		|ПОМЕСТИТЬ ВТТекущий
		|ИЗ
		|	ВТНачальные КАК ВТНачальные
		|СГРУППИРОВАТЬ ПО
		|	ВТНачальные.Спецификация,
		|	ВТНачальные.ГоловнаяСпецификация,
		|	ВТНачальные.ОсновноеИзделиеНоменклатура";
	Запрос.Выполнить();
	
	// Создаём таблицу уже обработанных спецификаций для защиты от циклов
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТНачальные.Спецификация КАК Спецификация
		|ПОМЕСТИТЬ ВТОбработанные
		|ИЗ
		|	ВТНачальные КАК ВТНачальные";
	Запрос.Выполнить();
	
	// Шаг 2: Итеративно поднимаемся вверх по дереву спецификаций
	// Ищем спецификации, которые используют текущие как полуфабрикаты
	МаксИтераций = 50; // защита от бесконечного цикла
	Для Итерация = 1 По МаксИтераций Цикл
		
		Запрос.Текст = 
			"// Находим все подходящие родительские спецификации
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РодСпец.Ссылка КАК Спецификация,
			|	РодСпец.Ссылка.Код КАК КодСпецификации,
			|	ВТТекущий.ГоловнаяСпецификация КАК ГоловнаяСпецификация,
			|	РодСпец.Ссылка.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
			|	ВЫБОР
			|		КОГДА РодСпец.Ссылка.ОсновноеИзделиеКоличествоУпаковок > 0
			|			ТОГДА ВТТекущий.УдельныйРасход * РодСпец.КоличествоУпаковок / РодСпец.Ссылка.ОсновноеИзделиеКоличествоУпаковок
			|		ИНАЧЕ ВТТекущий.УдельныйРасход * РодСпец.КоличествоУпаковок
			|	КОНЕЦ КАК УдельныйРасход
			|ПОМЕСТИТЬ ВТВсеРодительские
			|ИЗ
			|	ВТТекущий КАК ВТТекущий
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РодСпец
			|		ПО (РодСпец.Номенклатура = ВТТекущий.ОсновноеИзделиеНоменклатура
			|			ИЛИ РодСпец.ИсточникПолученияПолуфабриката = ВТТекущий.Спецификация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбработанные КАК Обработанные
			|		ПО РодСпец.Ссылка = Обработанные.Спецификация
			|ГДЕ
			|	Обработанные.Спецификация ЕСТЬ NULL
			|	И НЕ РодСпец.Ссылка.ПометкаУдаления
			|	И РодСпец.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
			|	И РодСпец.Ссылка.ВариантПодбораВДокументы = ЗНАЧЕНИЕ(Перечисление.ВариантыПодбораСпецификацииВДокументы.Автоматически)
			|	И (РодСпец.Ссылка.НачалоДействия = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ РодСпец.Ссылка.НачалоДействия <= &ДатаАктуальности)
			|	И (РодСпец.Ссылка.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ РодСпец.Ссылка.КонецДействия > &ДатаАктуальности)
			|;
			|// Находим максимальный код спецификации для каждого изделия (приоритетная)
			|ВЫБРАТЬ
			|	ВТВсеРодительские.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
			|	МАКСИМУМ(ВТВсеРодительские.КодСпецификации) КАК МаксКод
			|ПОМЕСТИТЬ ВТПриоритетныеКоды
			|ИЗ
			|	ВТВсеРодительские КАК ВТВсеРодительские
			|СГРУППИРОВАТЬ ПО
			|	ВТВсеРодительские.ОсновноеИзделиеНоменклатура
			|;
			|// Оставляем только приоритетные спецификации (с максимальным кодом)
			|ВЫБРАТЬ
			|	ВР.Спецификация КАК Спецификация,
			|	ВР.ГоловнаяСпецификация КАК ГоловнаяСпецификация,
			|	ВР.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
			|	ВР.УдельныйРасход КАК УдельныйРасход
			|ПОМЕСТИТЬ ВТНовый
			|ИЗ
			|	ВТВсеРодительские КАК ВР
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритетныеКоды КАК ПК
			|		ПО ВР.ОсновноеИзделиеНоменклатура = ПК.ОсновноеИзделиеНоменклатура
			|			И ВР.КодСпецификации = ПК.МаксКод
			|;
			|УНИЧТОЖИТЬ ВТВсеРодительские
			|;
			|УНИЧТОЖИТЬ ВТПриоритетныеКоды
			|;
			|УНИЧТОЖИТЬ ВТТекущий
			|;
			|ВЫБРАТЬ
			|	ВТНовый.Спецификация КАК Спецификация,
			|	ВТНовый.ГоловнаяСпецификация КАК ГоловнаяСпецификация,
			|	ВТНовый.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
			|	СУММА(ВТНовый.УдельныйРасход) КАК УдельныйРасход
			|ПОМЕСТИТЬ ВТТекущий
			|ИЗ
			|	ВТНовый КАК ВТНовый
			|СГРУППИРОВАТЬ ПО
			|	ВТНовый.Спецификация,
			|	ВТНовый.ГоловнаяСпецификация,
			|	ВТНовый.ОсновноеИзделиеНоменклатура
			|;
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	1 КАК Поле
			|ИЗ
			|	ВТНовый КАК ВТНовый
			|;
			|УНИЧТОЖИТЬ ВТНовый";
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		// Проверяем, есть ли новые записи (индекс 7 = ВЫБРАТЬ ПЕРВЫЕ 1)
		Если РезультатыЗапроса[7].Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		// Добавляем новый уровень к общим результатам
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВТНачальные.Спецификация КАК Спецификация,
			|	ВТНачальные.ГоловнаяСпецификация КАК ГоловнаяСпецификация,
			|	ВТНачальные.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
			|	ВТНачальные.УдельныйРасход КАК УдельныйРасход
			|ПОМЕСТИТЬ ВТНачальные2
			|ИЗ
			|	ВТНачальные КАК ВТНачальные
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТТекущий.Спецификация,
			|	ВТТекущий.ГоловнаяСпецификация,
			|	ВТТекущий.ОсновноеИзделиеНоменклатура,
			|	ВТТекущий.УдельныйРасход
			|ИЗ
			|	ВТТекущий КАК ВТТекущий
			|;
			|УНИЧТОЖИТЬ ВТНачальные
			|;
			|ВЫБРАТЬ
			|	ВТНачальные2.Спецификация КАК Спецификация,
			|	ВТНачальные2.ГоловнаяСпецификация КАК ГоловнаяСпецификация,
			|	ВТНачальные2.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
			|	ВТНачальные2.УдельныйРасход КАК УдельныйРасход
			|ПОМЕСТИТЬ ВТНачальные
			|ИЗ
			|	ВТНачальные2 КАК ВТНачальные2
			|;
			|УНИЧТОЖИТЬ ВТНачальные2
			|;
			|// Добавляем новые спецификации в список обработанных
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТОбработанные.Спецификация КАК Спецификация
			|ПОМЕСТИТЬ ВТОбработанные2
			|ИЗ
			|	ВТОбработанные КАК ВТОбработанные
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТТекущий.Спецификация
			|ИЗ
			|	ВТТекущий КАК ВТТекущий
			|;
			|УНИЧТОЖИТЬ ВТОбработанные
			|;
			|ВЫБРАТЬ
			|	ВТОбработанные2.Спецификация КАК Спецификация
			|ПОМЕСТИТЬ ВТОбработанные
			|ИЗ
			|	ВТОбработанные2 КАК ВТОбработанные2
			|;
			|УНИЧТОЖИТЬ ВТОбработанные2";
		Запрос.Выполнить();
		
	КонецЦикла;
	
	// Шаг 3: Выбираем итоговые данные - только головные спецификации (готовую продукцию)
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТНачальные.Спецификация.ОсновноеИзделиеНоменклатура КАК Номенклатура,
		|	ВТНачальные.Спецификация КАК Спецификация,
		|	СУММА(ВТНачальные.УдельныйРасход) КАК Количество
		|ИЗ
		|	ВТНачальные КАК ВТНачальные
		|ГДЕ
		|	ВТНачальные.Спецификация.ВариантПодбораВДокументы = ЗНАЧЕНИЕ(Перечисление.ВариантыПодбораСпецификацииВДокументы.Автоматически)
		|	И (&ТолькоИзделия = ЛОЖЬ
		|			ИЛИ ВТНачальные.Спецификация.ОсновноеИзделиеНоменклатура.ВидНоменклатуры В ИЕРАРХИИ (&ГруппаВидов))
		|СГРУППИРОВАТЬ ПО
		|	ВТНачальные.Спецификация,
		|	ВТНачальные.Спецификация.ОсновноеИзделиеНоменклатура";
	
	Запрос.УстановитьПараметр("ТолькоИзделия", ТолькоИзделия);
	Запрос.УстановитьПараметр("ГруппаВидов", ГруппаВидов);
	
	Применяемость.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт
	Возврат ЭТП.ЗарегистрироватьВнешнийОтчет("МатериалВИзделиях", "Применяемость материала в изделиях", Истина)   
КонецФункции
